Revit 2027 API
SlabShapeEditor.ModifySubElement Method
Manipulates an entity on the corresponding slab, roof or floor.
Overload List
Name | Description
ModifySubElement(SlabShapeCrease, Double) | Manipulates the crease on the corresponding slab, roof or floor.
ModifySubElement(SlabShapeVertex, Double) | Manipulates the vertex on the corresponding slab, roof or floor.
Top
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace